[
    {
        "source": {
            "id": null,
            "name": "The Star Online"
        },
        "author": "Sebastian Tong, Kurt Wagner",
        "title": "Elon Musk slams San Francisco for probe of bedrooms at Twitter HQ",
        "description": "Elon Musk on Dec 6 criticised San Francisco Mayor London Breed following a report the city is investigating Twitter Inc for setting up bedrooms at its headquarters, saying the company was being unfairly attacked for “providing beds for tired employees”. Read …",
        "url": "https://www.thestar.com.my/tech/tech-news/2022/12/07/elon-musk-slams-san-francisco-for-probe-of-bedrooms-at-twitter-hq",
        "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/12/07/1852128.jpg",
        "publishedAt": "2022-12-07T02:51:00Z",
        "content": "Elon Musk on Dec 6 criticised San Francisco Mayor London Breed following a report the city is investigating Twitter Inc for setting up bedrooms at its headquarters, saying the company was being unfai… [+1855 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Biztoc.com"
        },
        "author": "bitcoin.com",
        "title": "Lawmaker Pleads With Sam Bankman-Fried to Attend Congress Hearing on FTX",
        "description": "Congresswoman Maxine Waters, chair of the House Committee on Financial Services, has politely asked former FTX CEO Sam Bankman-Fried (SBF) to attend a congressional hearing on the collapse of his cryptocurrency exchange. Bankman-Fried says he will testify whe…",
        "url": "https://biztoc.com/x/387768ca42987f77",
        "urlToImage": "https://c.biztoc.com/p/387768ca42987f77/og.webp",
        "publishedAt": "2022-12-07T02:44:04Z",
        "content": "Congresswoman Maxine Waters, chair of the House Committee on Financial Services, has politely asked former FTX CEO Sam Bankman-Fried (SBF) to attend a congressional hearing on the collapse of his cry… [+981 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Business Standard"
        },
        "author": "Sebastian Tong & Kurt Wagner | Bloomberg",
        "title": "Elon Musk slams San Francisco for probe of bedrooms at Twitter headquarters",
        "description": "Twitter in recent weeks has turned several conference rooms at the office into makeshift bedrooms, complete with furniture like bedside tables and armchairs",
        "url": "https://www.business-standard.com/article/international/elon-musk-slams-san-francisco-for-probe-of-bedrooms-at-twitter-headquarters-122120700136_1.html",
        "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-12/07/full/1670379530-9546.jpg",
        "publishedAt": "2022-12-07T02:35:00Z",
        "content": "Elon Musk on Tuesday criticized San Francisco Mayor London Breed following a report the city is investigating Twitter Inc. for setting up bedrooms at its headquarters, saying the company was being un… [+2010 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Yahoo Entertainment"
        },
        "author": "Danny Lee and Eduardo Thomson",
        "title": "Warren Buffett 'Loves' China’s  BYD Despite Selldown, EV Executive Says",
        "description": "(Bloomberg) -- Warren Buffett “loves” China’s biggest electric-vehicle maker BYD Co. and isn’t abandoning it, a senior executive from the company said...",
        "url": "https://finance.yahoo.com/news/warren-buffett-loves-china-byd-013631117.html",
        "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5LIu7gpRKKuuKbdoAd7ZYg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Nzg-/https://media.zenfs.com/en/bloomberg_markets_842/c1e7e64f2ff2b33c5af01574ac8bf142",
        "publishedAt": "2022-12-07T01:36:31Z",
        "content": "(Bloomberg) -- Warren Buffett loves Chinas biggest electric-vehicle maker BYD Co. and isnt abandoning it, a senior executive from the company said, despite the legendary investors Berkshire Hathaway … [+2735 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Tech Times"
        },
        "author": "Isaiah Richard",
        "title": "Toyota Corolla Cross Hydrogen Concept: Clean Energy Without the Batteries—When is it Coming?",
        "description": "Not an EV, but uses a fuel cell which features zero emissions from Toyota's new vehicle.",
        "url": "https://www.techtimes.com/articles/284503/20221206/toyota-corolla-cross-hydrogen-concept-clean-energy-without-batteries—when-coming.htm",
        "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/416496/toyota-corolla-cross-h2-concept.jpg",
        "publishedAt": "2022-12-07T01:29:00Z",
        "content": "Toyota is proud to present its latest take on clean energy vehicles, and it is not featuring batteries to power the car. It is a hydrogen fuel cell that leaves high emissions behind, brought by gasol… [+3150 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "SiliconANGLE News"
        },
        "author": "Duncan Riley",
        "title": "Apple reportedly scales back car plans, postpones launch date to 2026",
        "description": "Apple Inc. is reported to have scaled back its plans for a self-dirving electric vehicle and postponed the launch date to 2026. Mark Gurman at Bloomberg claims that the project, known internally as Titan, has been in limbo for several months as Apple executiv…",
        "url": "https://siliconangle.com/2022/12/06/apple-reportedly-scales-back-car-plans-postpones-launch-date-2026/",
        "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2019/02/27050412940_5a0e5ac101_o.jpg",
        "publishedAt": "2022-12-07T01:27:43Z",
        "content": "Apple Inc. is reported to have scaled back its plans for a self-dirving electric vehicle and postponed the launch date to 2026.\r\nMark Gurman at Bloomberg claims that the project, known internally as … [+2848 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo Australia"
        },
        "author": "Zachariah Kelly",
        "title": "Polestar Wants to Be More Like Porsche Than Tesla, Says Australian Boss",
        "description": "After a successful year of operation in Australia, electric Volvo offshoot Polestar is aiming to look more like Porsche than Tesla.\nThe post Polestar Wants to Be More Like Porsche Than Tesla, Says Australian Boss appeared first on Gizmodo Australia.\n  Related…",
        "url": "https://www.gizmodo.com.au/2022/12/polestar-australia-interview/",
        "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/12/07/polestar-Porsche-australia.png?quality=80&resize=1280,720",
        "publishedAt": "2022-12-07T01:19:10Z",
        "content": "Polestar has had a tremendously good year in Australia. Entering the market as an expected ‘Tesla killer’, the company has existed in the shadow of Elon Musk’s company for a while. However, Polestar’… [+6002 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "CleanTechnica"
        },
        "author": "Guest Contributor",
        "title": "California Truckers, Help Is On The Way For Electric Trucking",
        "description": "Freight trucks are critical for the economy but represent a major source of California pollution. Many programs, from the federal to local level, are available to help pay for the transition to zero-emission vehicles. By Nick Chaset, CEO of East Bay Community…",
        "url": "https://cleantechnica.com/2022/12/06/california-truckers-help-is-on-the-way-for-electric-trucking/",
        "urlToImage": "https://cleantechnica.com/files/2022/12/Tesla-Semi-Hardcore-Testing-11.png",
        "publishedAt": "2022-12-07T01:11:49Z",
        "content": "Freight trucks are critical for the economy but represent a major source of California pollution. Many programs, from the federal to local level, are available to help pay for the transition to zero-… [+4810 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Biztoc.com"
        },
        "author": "benzinga.com",
        "title": "Tesla, Apple, MongoDB, GameStop, SentinelOne: Why These 5 Stocks Are Drawing Retail Investors' Attention Today",
        "description": "Major Wall Street indices closed over 1% lower on Tuesday as recession worries weighed on investors’ minds. The Nasdaq closed 2% lower, while the Dow Jones ended 1.03% down and the S&P 500 declined 1.44%. Meanwhile, the following five stocks are drawing retai…",
        "url": "https://biztoc.com/x/ef2f2d3998b25792",
        "urlToImage": "https://c.biztoc.com/p/ef2f2d3998b25792/og.webp",
        "publishedAt": "2022-12-07T01:04:05Z",
        "content": "Major Wall Street indices closed over 1% lower on Tuesday as recession worries weighed on investors minds. The Nasdaq closed 2% lower, while the Dow Jones ended 1.03% down and the S&amp;P 500 decline… [+957 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Theregister.com"
        },
        "author": "Katyanna Quach",
        "title": "Neuralink reportedly under investigation by Uncle Sam for animal welfare violations",
        "description": "Rushed 'hack job' surgeries cause creatures to needless die, staffers claim\nNeuralink is reportedly being investigated by the US government for mistreating animals used in lab experiments as the company rushes to build an implantable brain chip.…",
        "url": "https://www.theregister.com/2022/12/07/neuralink_investigation_animals/",
        "urlToImage": "https://regmedia.co.uk/2022/12/07/shutterstock_neuralink.jpg",
        "publishedAt": "2022-12-07T00:45:15Z",
        "content": "Neuralink is reportedly being investigated by the US government for possibly mistreating animals used in lab experiments as the company rushes to build an implantable brain chip.\r\nThe startup, founde… [+2866 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Biztoc.com"
        },
        "author": "marketwatch.com",
        "title": "Microsoft invested $1 billion in an AI system that helped me write this column. See what it had to say about Tesla",
        "description": "Can an artificial intelligence system help me write articles about investment ideas? Let’s find out. There are two subjects I would like to cover. But I will have help, and as a result there is a third topic that sprang from the two. Over the weekend, I signe…",
        "url": "https://biztoc.com/x/792c0f88cf706401",
        "urlToImage": "https://c.biztoc.com/p/792c0f88cf706401/og.webp",
        "publishedAt": "2022-12-07T00:30:04Z",
        "content": "Can an artificial intelligence system help me write articles about investment ideas? Lets find out.\r\nThere are two subjects I would like to cover. But I will have help, and as a result there is a thi… [+1006 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Realvision.com"
        },
        "author": "Real Vision Podcast Network",
        "title": "What’s the Matter With Big Tech?",
        "description": "The U.S. equity sell-off extended to a fourth straight trading session today, as the tech-heavy Nasdaq Composite again led to the downside with a 2.18% loss two hours ahead of the close. Meta Platforms is under regulatory scrutiny in the European Union, Apple…",
        "url": "https://www.realvision.com/shows/daily-briefing/videos/whats-the-matter-with-big-tech-pqAl",
        "urlToImage": "https://ichef.realvision.com/1336x/424843e31c9d454fb62136aa9b47a261/hero",
        "publishedAt": "2022-12-07T00:19:00Z",
        "content": "Featuring Maggie Lake and Eric Jackson\r\nDecember 06 at 9:00PM 31 minutes\r\nThe U.S. equity sell-off extended to a fourth straight trading session today, as the tech-heavy Nasdaq Composite again led to… [+1190 chars]"
    }
]